 <script>
import DefaultScene from "@/components/common/DefaultScene";
import { DefaultOptionTransition } from "@/store/DefaultOption";

export default class ChitchatMummy extends DefaultScene {
  public nameScene = "ChitchatMummy";
  public descriptionScene ='- Ну разумеется, мне это не трудно!\n' +
      ' \n' +
      ' С этими словами археолог закатал рукав своей рубахи примерно по локоть и вытянул руку в вашу сторону.\n' +
      ' - Как? - изумленно воскликнули вы, - Неужели у вас в качестве протеза мумифицированная рука' +
      ' угупетского фараона?\n' +
      ' - Да нет же, - пояснил Джокс, - просто та рука была почти такая, только желтая...' +
      ' и совершенно высушенная... и твердая, как селенит. И обмотана грязными тряпками.' +
      ' Да еще не такая грязная и волосатая, - добавил он, опуская рукав.\n' +
      ' - А где же рука мумии?\n' +
      ' - Да той руки уже давно у меня нет. Я ее подарил Ларе Томбовне.' +
      ' Так сказать, руку и сердце, хе-хе. Правда, сердце было не самого фараона,' +
      ' а его слуги, но это уже мелочи.\n'
  options = [
    new DefaultOptionTransition(
        'Мда, похоже, что доктор частенько выбегал под солнышко без шляпы...',
       'ChitchatFirst',
    ),
  ];
}
</script>

<style scoped>

</style>