<script lang="ts">
import DefaultScene from "@/components/common/DefaultScene.vue";
import { DefaultOptionTransition } from "@/store/DefaultOption";

export default class ChitchatIntro extends DefaultScene {
  public nameScene = "ChitchatFirst";
  public descriptionScene =
      " - Хорошо, - доктор Джокс откинулся в кресле и жестом предложил вам угощаться из мини-бара." +
      " - Признаться, давненько мне не приходилось общаться с разбирающимся в предметах старины рейнджером." +
      " Последний был этот пеленг - кажется... лякуша Борзухан, или Барзумян?" +
      " Он пытался мне продать старинный электрический миксер под видом древнего пеленгского орудия" +
      " пыток - Кишковыворота, использовавшегося Дзухаллагом более тысячи лет назад!\n" +
      " - Да уж, мошенников хватает. Что интересного вы можете мне рассказать?\n" +
      " - Да, пожалуй, и на неделю беседы не хватит. Могу рассказать вам историю Черного Странника," +
      " популярную среди археологов-пустынников, хотя, пожалуй, она слишком страшная." +
      " Если вас интересует, могу показать переведенный профессором Шпрехом Зидочем фрагмент дневника сына Перехотепа" +
      " - тот самый, про пирамиду. Или руку мумии фараона Ханамнеса. А может, загадать вам древнеугупетскую загадку?" +
      " Вы похожи на азартного человека.\n" +
      " \n" +
      " Археолог умолк и уставился на вас." +
      " Климатизаторы <span>\"Отморозко\"</span> тихо шелестели, навевая приятную прохладу.";

  deactivated() {
    this.descriptionScene = 'Археолог приветливо смотрит на вас, медленно потягивая прохладное ' +
        'мартини из запотевшего бокала. Похоже, он нашел в вас приятного собеседника и рад поделиться своими знаниями.'
  }

  options = [
    new DefaultOptionTransition(
        'Вы прекрасный собеседник и замечательный специалист по древностям,' +
        ' но у нас есть дело - расскажите легенду о братьях',
        'LegendIntro'
    ),
    new DefaultOptionTransition(
        'Я с удовольствием почитал бы дневник в переводе от профессора Зидоча.' +
        ' Его эксцентрично-литературные переводы меня восхищают',
        'ChitchatDiary',
    ),
    new DefaultOptionTransition(
        'Рука мумии? Думаю, что буду просто счастлив увидеть такую редкость' +
        ' - если вас не затруднит, доктор',
        'ChitchatMummy',

    ),
    new DefaultOptionTransition(
        'А что это у вас лежит? Не "Малая ли Энциклопедия Богов" самого Склерозуса?',
        'ChitchatBook',
    ),
    new DefaultOptionTransition(
        'Я просто обожаю всяческие загадки.' +
        ' Думаю, ваша не так хороша, как вы считаете. Может, загадаете ее мне?',
        'ChitchatPuzzle'
    ),
    new DefaultOptionTransition(
        'Кстати, доктор Джокс, может, расскажите,' +
        ' что вы искали на планете Граал - я много слышал о вашей экспедиции...',
        'ChitchatGraal'
    ),
  ];


}
}
</script>
