<template>
  <DefaultScene :options="options" :picName="picName">
<span> "Пригласили рымского гладиатора Минимуса. Приволок целый щит дурман-травы, купленной у Хачика Абрамяна. Щит большой, влазит много.<br> Пили, курили дурман-траву, заигрывали с рабынями. Почему-то теперь они все как на подбор. Пробило на хи-хи - спалили половину храма. Нужно попросить Минимуса сменить щит.<br> Вернулся писарь Мар Аттель. Без рабов. Без рабынь. Без денег. Плакал, во всем винил какого-то Абдулбиса. Отослали к Зоофилесу.<br> Пили, курили. Минимуса убило молнией - небо смеялось. Вспомнили, что Абдулбис по совместительству подрабатывает богом зла. Ждем в гости. Все куда-то разбежались. Интересно, сколько у Зоофилеса львов?<br> Вылизали пустые бочки и щит Минимуса. Скучно. Абдулбис так и не пришел. Засчитали ему техническое поражение - за неявку.<br> Вспомнили, что забыли закрыть гробницу отца. <br> Недолго думая, отмыкающим ключом сделали символ одного из полубогов. Того самого, что является покровителем четырех из нас.<br> Пошли искать Настрадамуса - пусть хоть ужастиков каких на ночь расскажет..."<br> Вы дочитали фрагмент дневника и отложили его в сторону.</span>
  </DefaultScene>
</template>


<script lang="ts">
import DefaultScene from "@/components/common/DefaultScene.vue";
import { DefaultOptionTransition } from "@/store/DefaultOption";
import { Options, Vue } from "vue-class-component";
@Options({ components: { DefaultScene } })
export default class ChitchatDiary2 extends Vue {
  public nameScene = "ChitchatDiary2";
  public picName = "tomb_03";

  options = [
    new DefaultOptionTransition(
        'Спасибо, это было очень увлекательное чтение!!!',
        'ChitchatFirst',
    ),
  ];
}
</script>
