<script lang="ts">
import DefaultScene from "@/components/common/DefaultScene.vue";
import { DefaultOptionTransition } from "@/store/DefaultOption";

export default class ChitchatDiary2 extends DefaultScene {
  public nameScene = "ChitchatDiary2";
  public picName = "tomb_03";
  public descriptionScene =  '"Пригласили рымского гладиатора Минимуса. ' +
      'Приволок целый щит дурман-травы, купленной у Хачика Абрамяна. ' +
      'Щит большой, влазит много. Пили, курили дурман-траву, заигрывали с рабынями.' +
      ' Почему-то теперь они все как на подбор. Пробило на хи-хи - спалили половину храма. ' +
      'Нужно попросить Минимуса сменить щит. Вернулся писарь Мар Аттель. Без рабов. Без рабынь.' +
      ' Без денег. Плакал, во всем винил какого-то Абдулбиса. Отослали к Зоофилесу. Пили, курили. ' +
      'Минимуса убило молнией - небо смеялось. Вспомнили, что Абдулбис по совместительству подрабатывает богом зла.' +
      ' Ждем в гости. Все куда-то разбежались. Интересно, сколько у Зоофилеса львов?' +
      ' Вылизали пустые бочки и щит Минимуса. Скучно. Абдулбис так и не пришел.' +
      ' Засчитали ему техническое поражение - за неявку. Вспомнили, что забыли закрыть гробницу отца.' +
      ' Недолго думая, отмыкающим ключом сделали символ одного из полубогов. Того самого, что является' +
      ' покровителем четырех из нас. Пошли искать Настрадамуса - пусть хоть ужастиков каких на ночь расскажет..."' +
      ' Вы дочитали фрагмент дневника и отложили его в сторону.'

  options = [
    new DefaultOptionTransition(
        'Спасибо, это было очень увлекательное чтение!!!',
        'ChitchatFirst',
    ),
  ];
}
</script>
