<script lang="ts">
import DefaultScene from "@/components/common/DefaultScene.vue";
import { DefaultOptionTransition } from "@/store/DefaultOption";

export default class ChitchatIntro extends DefaultScene {
  public nameScene = "LegendIntro";
  public descriptionScene = " Доктор археологии Индий Джокс взял пачку листов и начал читать:\n" +
      " \n" +
      " \"В давние времена был правителем земель угупетских ужасный снаружи и добрый внутри фараон" +
      " Перехотеп Тринадцатый. И было у него семь сыновей - шесть оболтусов и старший, умник." +
      " Как-то утром испуганный раб вбежал к ним в покои: слег отец, с подозрением на нетипичную пневмонию." +
      " Кинулись сыновья к отцовской кровати:\n" +
      " - Тятька, не покидай нас, - зарыдал испуганный Серемтут, а за ним и Мойхренес\n" +
      " - Хорош вопить, мелюзга, - оборвал Вертепопес, пряча в тунике недописанное любовное послание." +
      " - Отец, что с тобой?\n" +
      " - Уши мои уже не видят, глаза мои уже не слышат - настал мой час." +
      " Идите далеко-далеко в пустыню - за вторым миражом первый поворот направо, и до ближайшего оазиса. " +
      "В нем - загадочная Обитель Богов. Только боги властны над жизнью и смертью.\n" +
      " - Острый приступ пневматической остеохандрии и эллиптической пессиместии, - изрек Замполет.\n" +
      " - Значит, надо собираться в путь! - подал голос Ептимат.\n" +
      " - Ура!!! Значит, завтра в школу не пойдем, можно уроки не делать, - завопил Мойхренес.\n" +
      " - Ага, а мой выпускной? - расстроился шестой сын." +
      " - Я уже договорился с прекрасной Бюстиарой быть моей королевой бала...\n" +
      " - Нечего лясы точить, пора припасы в дорогу собирать, - подал голос вечноголодный Анусптис, " +
      "и братья, поклонившись, покинули отца.\n" +
      " \n" +
      " Долго брели сыновья фараона по пустыне. Вертепопес жаловался," +
      " что не может побриться, и скучал по женской ласке, тогда как Анусптис вдвое скинул в весе." +
      " В первой же таверне они попали на большой праздник, где Рамзец," +
      " Серемтут и Мойхренес с непривычки перебрали вина, пришлось Ептимату разнимать драку," +
      " в которую они вмешались, защищая четвертого сына. Пригодилась выучка воина и опыт уличных драк...\"\n" +
      " \n" +
      " Здесь археолог остановился, чтобы перевести дух, и посмотрел на вас.";


  options = [
    new DefaultOptionTransition(
        'Слушать дальше',
        'Legend2'
    ),
    new DefaultOptionTransition(
        'Думаю, что уже достаточно услышал. Пора приступать...',
        'SolveInit'
    ),
  ];


}
</script>
