<script lang="ts">
import DefaultScene from "@/components/common/DefaultScene.vue";
import { DefaultOptionTransition } from "@/store/DefaultOption";
import { Options, Vue } from "vue-class-component";
@Options({ components: { DefaultScene } })
export default class LegendSecond extends Vue {
  public nameScene = "LegendSecond";
  picName = 'tomb_03';
  public descriptionScene = ' Археолог продолжил чтение:<br>' +
      ' <br>' +
      ' "Пока Замполет бранил драчунов, четвертый сын вовсю заигрывал со служанкой, из-за которой и началась драка.' +
      ' Но все хорошее, в том числе и деньги, когда-нибудь кончается, и братья продолжили путь.<br>' +
      ' В одном из оазисов они наткнулись на завтракающего льва, и второй сын, демонстрируя свою отвагу и' +
      ' прогрессирующий идиотизм, полез в драку...<br>' +
      ' - Присмотри за младшими, - приказал Замполет Серемтуту, а сам с двумя братьями ринулся на подмогу.' +
      ' Однако силы были не равны - если бы Анусптис не сел на грозного хищника и не раздавил ему лапы,' +
      ' сыновьям Перехотепа Тринадцатого пришлось бы худо.<br>' +
      ' Мясо льва оказалось несъедобным, и бедняга Анусптис едва сдерживал рыдания.' +
      ' Даже вечно веселый пятый сын никого не подкалывал и не травил бородатые анекдоты...<br>' +
      ' <br>' +
      ' Но вскоре горести пути были позади - свернув после второго миража, как велел фараон,' +
      ' его сыновья вышли к Обители Богов. Двое старших отправились корешаться с Великими,' +
      ' оставив, как пошутил Рамзец, "самого тяжелого" - присматривать.<br>' +
      ' <br>' +
      ' Боги оказались не такими уж и страшными - если на них не смотреть. Они даже накормили братьев' +
      ' и предоставили им ароматическую ванну, чему был не очень рад Мойхренес, презиравший средства личной гигиены.' +
      ' Заигрывающий с богиней Ищидой Вертепопес был превращен в жабу-принца, и его чуть не слопал Анусптис,' +
      ' а шестой сын был рад узнать о переносе выпускного бала. Но самая приятная новость была об отце:<br>' +
      ' <br>' +
      ' "Жить ваш отец будет в счастье и веселье еще один день и три года, а чтоб не умер он раньше этого срока,' +
      ' должны вы, сыновья его, возвести пирамиду огромную, дабы величие и богатство Перехотепа Тринадцатого она' +
      ' собой воплощала долгие века" - так напутствовал братьев сам Гамон-Ра, отправляя их в обратный путь..."<br>' +
      ' <br>' +
      ' На этом текст легенды обрывался.';

  options = [
    new DefaultOptionTransition(
        'Э нет, ищите другого дурака. Я убираюсь с этой планеты...',
        'FailReject',
        null, null,
        () => !this.gameStore.mainSolved,
    ),
    new DefaultOptionTransition(
        'А можно еще раз послушать?',
        'LegendFirst',
        undefined,
        null,
        () => !this.gameStore.mainSolved,
    ),
    new DefaultOptionTransition(
        'Думаю, что уже достаточно услышал. Пора приступать...',
        'SolveInit',
        undefined,
        null,
        () => !this.gameStore.mainSolved,
    ),
    new DefaultOptionTransition(
        'Взяться за открывание шкатулки',
        'AdditionalSolveInit',
        undefined,
        null,
        () => this.gameStore.mainSolved,
    ),
  ];
}
</script>
