<template>
  <div>
    <div class="text">
      <span class="text-success">Греф</span>! Надеюсь, что вы прекрасно справитесь с одним несложным поручением.
      Думаю, вам частенько приходилось иметь дело с различными древностями, представляющими немалую историческую, да и
      материальную ценность. Особенно с предметами роскоши, хе-хе. Поэтому и задание, которое я вам предлагаю, не
      потребует от вас ничего сверхъестественного.<br>
      Дело в том, что наш Институт Коммерческой Археологии при
      поддержке правительства проводит изыскания на планете
      <span class="text-success">Боннасис</span>, что в системе
      <span class="text-success">Процион</span>. Как оказалось, эта пустынная планета не всегда была безжизненна, и
      когда-то на ней существовала высокоразвитая гуманоидная цивилизация. Нашими учеными была найдена гробница древнего
      царька - фараона по-ихнему - Перехотепа Тринадцатого. Уникальнейшая находка со времен раскопок статуи Богини
      Электричества на планете Земля - той, громадной, с факелом в руке. Но вот беда. Продвинуться дальше первой комнаты
      нам так и не удалось за последние несколько месяцев, а уже <span class="text-success">26 Декабря 3020</span>
      истекает срок экспедиции, и археологи будут вынуждены вернуться, так и не разгадав тайну угуптянских пирамид. Если
      вы поможете нам проникнуть в гробницу до завершения экспедиции, то ИКАР щедро вас наградит.
    </div>
    <div>
      <button :onclick="started">
        <i class="fa fa-rocket"></i>Начать</button>
    </div>
  </div>
</template>
<script lang="ts">
import { getModule } from "vuex-module-decorators";
import GameStore from "@/store/GameStore";
import { Vue } from "vue-class-component";

export default class Begin extends Vue {
  protected gameStore = getModule(GameStore);

  started() {
    this.gameStore.changeBegin();
  }

}
</script>
<style lang="stylus">
.text
  max-width 1280px
  text-align left
  padding 10px 100px
  margin 0 auto
</style>