<template>
  <DefaultScene :options="options" :picName="picName">
    <span> По наводящему сигналу вы опустились в центре выжженной пустыни.
      Неподалеку находился палаточный лагерь археологов, накрытый куполом светоотражающего поля.
      Прямо за ним возвышалась громадная пирамида, сложенная из каменных блоков.
      Массивное сооружение поражало своими размерами и внушало благоговейный
      трепет - ведь его возвели примитивные дикари, жившие тысячи лет назад.<br> <br>
      Едва двигатели смолкли, и поднятая ими туча песка осела, вы вошли в лагерь.
      В центральной палатке вас встретил среднего возраста человек,
      назвавшийся доктором Индием Джоксом.
      На его поясе висел нейрохлыст и плазменный револьвер марки "Сыт и Весел".
      Взяв предложенный бокал прохладного сока, вы начали разговор.
      Естественно, о пирамиде.<br>
      <br>
      - Это гробница древнеугупетского фараона Перехотепа Тринадцатого, - рассказывал археолог.
      - Она была построена его сыновьями и является чем-то вроде сокровищницы.
      Находящиеся в ней артефакты и письменные источники бесценны для понимания культуры и быта аборигенов той эпохи!
      Это было бы грандиозное открытие. К сожалению, мы никак не можем попасть внутрь - пирамида герметично запечатана.
      У нас есть лишь доступ к маленькой комнате с запертыми вратами.
      Рядом стоят <span class="text-success">семь статуэток</span> младших богов,
      <span class="text-success">с ключами</span> в руках.
      Это боги <span class="text-success">Арес, Вмаз, Звер, Зевс, Зема, Марс и Мерс</span>.
      Один из них наверняка открывает врата в пирамиду, но мы не знаем, какой именно.<br>
      <br>
      - Всего семь?! - изумились вы. - Но ведь это совсем немного!
      Почему бы не попробовать все варианты?<br>
      <br>
      - Что вы, что вы?! - в ужасе замахал руками Джокс.
      - Это совершенно недопустимо!
      Неправильный выбор может просто заблокировать механизм, и мы никогда не попадем внутрь.
      Или того хуже - можно разрушить пирамиду.
      На планете Хиросаки попытка воспользоваться неверным ключом привела к ядерному взрыву,
      который смел с лица планеты не только две экспедиции, но и саму гробницу!
      Вы же понимаете, что мы не можем рисковать уничтожением такого ценного памятника старины,
      да это и опасно для жизни! Именно поэтому вы нам и нужны.
    </span>
  </DefaultScene>
</template>
<script lang="ts">
import DefaultScene from "@/components/common/DefaultScene.vue";
import { DefaultOptionTransition } from "@/store/DefaultOption";
import { Options, Vue } from "vue-class-component";

@Options({ components: { DefaultScene } })
export default class Initial extends Vue {
  public nameScene = "Initial";
  public picName = "pharaoh_00";

  options = [
    new DefaultOptionTransition(
        'И что - неужели у вас нет совершенно ничего, что могло бы помочь? И никаких идей?',
        'Intro'
    ),
  ];
}

</script>
<style lang="stylus">
button
  width 300px
  height 35px
  font-size 20px
</style>
