<script lang="ts">
import DefaultScene from "@/components/common/DefaultScene.vue";
import { DefaultOptionTransition } from "@/store/DefaultOption";

export default class Intro extends DefaultScene {
  public nameScene = "Intro";
  public descriptionScene = " - Мы обладаем информацией, которая может помочь попасть в гробницу," +
      " но так и не сумели пока правильно ею воспользоваться." +
      " Вот, смотрите - это дневник одного из сыновей фараона Перехотепа." +
      " В нем сказано, что при строительстве хранителем ключа сделали бога," +
      " покровительствующего <span>2, 5, 6 и 7</span> сыновьям фараона." +
      " Цифры - это порядок старшинства: 1 - старший, 2 - появился на свет вслед за ним, и так до седьмого сына," +
      " самого младшего. Угуптяне верили, что если первая буква имени человека встречается в имени бога," +
      " то этот бог является его покровителем." +
      " Например, бог Арес покровительствует людям, чьи имена начинаются с букв А, Р, Е или С." +
      " Значит, статуэтка бога, в имени которого есть первые буквы имен" +
      " этих четырех сыновей фараона, и будет хранителем ключа.\n" +
      " \n" +
      " - А что вы знаете о сыновьях фараона?\n" +
      " \n" +
      " - У фараона Перехотепа Тринадцатого было семь сыновей." +
      " Их звали <span>Анусптис, Вертепопес, Ептимат, Замполет, Мойхренес, Рамзец и Серемтут.</span>" +
      " Но нам неизвестен порядок их старшинства! Мы изучили все источники," +
      " но мнения моих коллег по этому поводу разошлись." +
      " Наиболее полная информация содержится в одной легенде, связанной со строительством пирамиды." +
      " Возможно, вам удастся установить порядок появления на свет сыновей фараона, изучив эту легенду?" +
      " А то наши умники уже охрипли, ругаясь. Боюсь, как бы до мордобоя не дошло..."

  options = [
    new DefaultOptionTransition(
        '',
        ''
    ),
    new DefaultOptionTransition(
        '',
        ''
    ),
  ];
}
</script>