<template>
  <div>
    <div>
      Прекрасно! Эта гробница оказалась настоящим самородком для археологии и нашего бюджета.
      Древние знания исчезнувшей цивилизации не имеют цены, я уже не говорю о сокровищах фараона
      Перехотепа Тринадцатого. Вам причитается просто огромное вознаграждение за помощь. Но, к
      сожалению, Галактическое Археологическое Общество настаивает на переписи и оценке найденных
      предметов, поэтому до завершения процедуры мы не можем заплатить ваши 0,000025% от стоимости
      находки. Но не расстраивайтесь - Институт Коммерческой Археологии выплачивает вам 65535 cr
      за вашу помощь... К тому же, я думаю, лет через 300-400 ГАО закончит опись найденных предметов,
      и тогда вы или ваши потомки получите причитающееся вам вознаграждение...
    </div>
  </div>
</template>

<script>

import { Vue } from "vue-class-component";

export default class Success extends Vue {
}
</script>

<style scoped>

</style>