<script lang="ts">
import DefaultScene from "@/components/common/DefaultScene.vue";
import { DefaultOptionTransition } from "@/store/DefaultOption";

export default class Correct extends DefaultScene {
  public nameScene = "Correct";
  picName = "pharaoh_00";
  public descriptionScene =
      ' Вы взяли ромбический ключ из рук статуэтки и вставили его в паз на вратах.' +
      ' Что-то негромко щелкнуло. Пирамида мелко затряслась, и на вас посыпался песок с потолка.\n' +
      ' - Ой, кажется, я что-то напутал, - вслух подумали вы и бросились прочь из гробницы.' +
      ' Но у самого выхода вы заметили, как дверь мягко сдвинулась с места...' +
      ' Вход в гробницу был открыт! Вы по рации связались с Джоксом, и вскоре десятки ученых' +
      ' ползали по всем уголкам пирамиды, восхищенно охая и радостно хохоча.' +
      ' Вы вернулись в лагерь, чтобы собрать свои вещи.\n' +
      ' \n' +
      ' - Вы проделали прекрасную работу, Греф, - к вам подошел доктор Джокс' +
      ' с какой-то шкатулкой в руках. Я уже отправил отчет в ИКАР о ваших заслугах.' +
      ' Но знаете... у меня есть к вам личная просьба. Вы только не подумайте,' +
      ' я вам заплачу за ваши хлопоты. Скажем, 500 cr. Прямо здесь и наличными.' +
      ' Вы ничего не теряете в любом случае, и можете заработать.\n' +
      ' - Что я должен сделать?\n' +
      ' - Всего лишь открыть эту шкатулку. Смотрите. Здесь есть семь отверстий.' +
      ' И я рядом нашел семь статуэток, которые входят в эти отверстия.' +
      ' Как я понял, нужно просто вставить статуэтки по порядку - и готово!' +
      ' Это статуэтки тех самых братьев, и их нужно расположить в порядке старшинства:' +
      ' первая - статуэтка старшего, вторая - родившегося после него, и так далее...' +
      ' Ну как, беретесь?';

  options = [
    new DefaultOptionTransition(
        'Пожалуй, я не буду рисковать - кто знает, чем чревата неудачная попытка',
        '',
    ),
    new DefaultOptionTransition(
        'Пожалуй, я рискну. Расположить их от старшего до младшего - не так уж и сложно',
        '',
    ),
  ];
}

</script>
