<template>
  <DefaultScene :options="options" :picName="picName">
  <span>
   Вы взяли ромбический ключ из рук статуэтки и вставили его в паз на вратах.
  Что-то негромко щелкнуло. Пирамида мелко затряслась, и на вас посыпался песок с
  потолка.<br> - Ой, кажется, я что-то напутал, - вслух подумали вы и бросились
  прочь из гробницы. Едва вы отбежали на сотню шагов, как позади раздался мерный грохот.
  Обернувшись, вы увидели, как все сооружение медленно погружается в песок.
  Пять минут спустя ничего не говорило о том, что здесь стояла огромная каменная
  пирамида. <br> <br> Откуда-то выскочил доктор Джокс, он дико вращал
  глазами и плазменным револьвером, сыпал на вас проклятьями и горстями колючего
  песка. В общем, почему-то вел себя очень хамски и неуравновешенно. Не обращая
  на него никакого внимания, вы сели в свой корабль, мечтая убраться подальше из
  этой печки.<br> <br> <span class="text-success">Ваша миссия провалена!</span>
  </span>
  </DefaultScene>
</template>
<script lang="ts">
import DefaultScene from "@/components/common/DefaultScene.vue";
import { Options, Vue } from "vue-class-component";

@Options({ components: { DefaultScene } })
export default class Fail extends Vue {
  public static nameScene = "Fail";
  picName = "pharaoh_02";
  options = [];
}

</script>
