<script lang="ts">
import DefaultScene from "@/components/common/DefaultScene.vue";

export default class Fail extends DefaultScene {
  public nameScene = "Fail";
  picName = "pharaoh_02";
  public descriptionScene =
      " Вы взяли ромбический ключ из рук статуэтки и вставили его в паз на вратах." +
      " Что-то негромко щелкнуло. Пирамида мелко затряслась, и на вас посыпался песок с потолка.\n" +
      " - Ой, кажется, я что-то напутал, - вслух подумали вы и бросились прочь из гробницы." +
      " Едва вы отбежали на сотню шагов, как позади раздался мерный грохот." +
      " Обернувшись, вы увидели, как все сооружение медленно погружается в песок." +
      " Пять минут спустя ничего не говорило о том, что здесь стояла огромная каменная пирамида.\n" +
      " \n" +
      " Откуда-то выскочил доктор Джокс, он дико вращал глазами и плазменным револьвером," +
      " сыпал на вас проклятьями и горстями колючего песка." +
      " В общем, почему-то вел себя очень хамски и неуравновешенно." +
      " Не обращая на него никакого внимания, вы сели в свой корабль," +
      " мечтая убраться подальше из этой печки.\n" +
      " \n" +
      " <span>Ваша миссия провалена!</span>";

  options = [];
}

</script>
