<script lang="ts">
import DefaultScene from "@/components/common/DefaultScene.vue";
import { DefaultOptionTransition } from "@/store/DefaultOption";

export default class SolveInit extends DefaultScene {
  public nameScene = "SolveInit";
  public descriptionScene =
      " Вы проследовали за Джоксом к пирамиде." +
      " Вход в единственную доступную комнату был накрыт специальным защитным полем.\n" +
      " - Дальше я не пойду, - Индий пожал вам руку на прощание и махнул рукой," +
      " - Ну, прощайте, а я пока предупрежу археологов, чтобы они экстренно эвакуировались.\n" +
      " - А вы куда?\n" +
      " - В бомбоубежи... в смысле, подготовить холодное шампанское для празднования." +
      " Удачи вам, и пусть песок вам будет пухом...\n" +
      " С этими словами он бегом рванул в сторону лагеря.\n" +
      " \n" +
      " Вы вошли в комнату. Прямо перед вами находилась дверь, украшенная резьбой," +
      " изображающей различных животных. Возле двери стояли семь статуэток низших богов," +
      " каждая из которых находилась в неглубокой выемке. Согласно \"Малому справочнику Старших Богов\"" +
      " и \"Большому справочнику Младших\", это были Арес, Вмаз, Звер, Зевс, Зема, Марс и Мерс." +
      " Каждая статуэтка держала в руках ромбовидную каменную призму, покрытую древнеугупетскими письменами." +
      " На вратах в пирамиду вы заметили выемку, точно подходящую для этих ключей, точнее, одного из них.\n" +
      " \n" +
      " Итак, каким ключом вы будете открывать гробницу?"
  options = [
    new DefaultOptionTransition(
        'И что - неужели у вас нет совершенно ничего, что могло бы помочь? И никаких идей?',
        'Intro'
    ),
  ];
}

</script>

</script>
